[Language]
;0-auto detected, or use hex number, see in MSDN GetUserDefaultLangID()
Language = 0
CommonFile = "GOCommon.ini"

[Mapping]
;Default language is 0x0409 English (United States) 
Default=0409
;Mapping 0x1004 Chinese (Singapore) to 0x0404 Chinese (Taiwan Region) 
1004=0404
;Mapping 0x080c French (Belgian) to 0x0407 French (Standard) 
080c=040c
;Mapping 0x100c French (Swiss)  to 0x0407 French (Standard) 
100c=040c
;Mapping 0x140c French (Luxembourg)  to 0x0407 French (Standard) 
140c=040c
;Mapping 0x0807 German (Swiss)  to 0x0407 German (Standard) 
0807=0407
;Mapping 0x0c07 German (Austrian)  to 0x0407 German (Standard) 
0c07=0407
;Mapping 0x1007 German (Luxembourg)  to 0x0407 German (Standard) 
1007=0407
;Mapping 0x1407 German (Liechtenstein) to 0x0407 German (Standard) 
1407=0407
;Mapping 0x0810 Italian (Swiss)  to 0x0410 Italian (Standard) 
0810=0410
;Mapping 0x080a Spanish (Mexican)  to 0x540a Spanish (US Sort)
080a=540a
;Mapping 0x0c0a Spanish (Modern Sort)  to 0x040a Spanish (Traditional Sort)
0c0a=040a
;Mapping 0x001A Croatian (Neutral) to 0x041A Croatian (Standard) 
001A=041A
;Mapping 0x0814 Nynorsk Norway to 0x0414 Bokmål Norway 
0814=0414
;Mapping Serbian
1C1A=7C1A
;Mapping Serbian
181A=7C1A
;Mapping Serbian
0C1A=7C1A
;Mapping Serbian
081A=7C1A
;Mapping Swedish
041D=081D

;English (United States)
[0409]
IDS_PRODUCT_NAME					= "Smart Data Link"
IDS_OK = "OK"
IDS_CANCEL = "Cancel"
IDS_YES = "Yes"
IDS_NO = "No"
IDS_MSG_INFORMATION					= "Information"
IDS_MSG_WARN						= "Warning"
IDS_MSG_ERROR						= "Error"
IDS_MSG_QUS_CONFIRM					= "Confirmation"
IDS_UNCOMPRESS_AND_LOAD					= "Uncompressing and loading, please wait..."

;French (Standard)
[040c]
IDS_OK = "OK "
IDS_CANCEL = "Annuler"
IDS_YES = "Oui"
IDS_NO = "Non"
IDS_EXIT   = "Quitter"
IDS_MSG_INFORMATION						= "Information"
IDS_MSG_WARN							= "Avertissement"
IDS_MSG_ERROR							= "Erreur"
IDS_MSG_QUS_CONFIRM						= "Confirmation"
IDS_UNCOMPRESS_AND_LOAD	=	"Décompression et chargement, veuillez patienter..."

;German (Standard) 
[0407]
IDS_OK = "OK"
IDS_CANCEL = "Abbrechen"
IDS_YES = "Ja"
IDS_NO = "Nein"
IDS_MSG_INFORMATION	=	"Informationen"
IDS_MSG_WARN	=	"Warnhinweis"
IDS_MSG_ERROR	=	"Fehler"
IDS_MSG_QUS_CONFIRM	=	"Bestätigung"
IDS_UNCOMPRESS_AND_LOAD	=	"Entpacke und lade, bitte warten..."

;Italian (Standard)
[0410]
IDS_OK = "OK"
IDS_CANCEL = "Annulla"
IDS_YES = "Sì"
IDS_NO = "No"
IDS_MSG_INFORMATION						= "Informazione"
IDS_MSG_WARN							= "Attenzione"
IDS_MSG_ERROR							= "Errore"
IDS_MSG_QUS_CONFIRM						= "Conferma"
IDS_UNCOMPRESS_AND_LOAD	=	"Decompressione e caricamento, attendere prego..."


;Spanish (Traditional Sort) 
[040a]
IDS_OK = "Aceptar"
IDS_CANCEL = "Cancelar"
IDS_YES = "Sí"
IDS_NO = "No"
IDS_MSG_INFORMATION	=	"Información"
IDS_MSG_WARN	=	"Aviso"
IDS_MSG_ERROR	=	"Error"
IDS_MSG_QUS_CONFIRM	=	"Confirmación"
IDS_UNCOMPRESS_AND_LOAD	=	"Descomprimiendo y cargando, espere..."


;Spanish (US) 
[540a]
IDS_MSG_INFORMATION	=	"Información"
IDS_MSG_WARN	=	"Advertencia"
IDS_MSG_ERROR	=	"Error"
IDS_MSG_QUS_CONFIRM	=	"Confirmación"
IDS_OK	=	"Aceptar"
IDS_CANCEL	=	"Cancelar"
IDS_YES	=	"Sí"
IDS_NO	=	"No"
IDS_UNCOMPRESS_AND_LOAD	=	"Descomprimiendo y cargando, espere..."



;Chinese (Taiwan Region)
[0404]
IDS_OK = "確定"
IDS_CANCEL = "取消"
IDS_YES = "是"
IDS_NO = "否"
IDS_MSG_INFORMATION	=	"資訊"
IDS_MSG_WARN	=	"警告"
IDS_MSG_ERROR	=	"錯誤"
IDS_MSG_QUS_CONFIRM	=	"確認"
IDS_UNCOMPRESS_AND_LOAD					= "解壓縮與載入程式中，請稍候..."

;Chinese (PRC)
[0804]
IDS_OK = "确定"
IDS_CANCEL = "取消"
IDS_YES = "是"
IDS_NO = "否"
IDS_MSG_INFORMATION	=	"信息"
IDS_MSG_WARN	=	"警告"
IDS_MSG_ERROR	=	"错误"
IDS_MSG_QUS_CONFIRM	=	"确认"
IDS_UNCOMPRESS_AND_LOAD	=	"正在解压缩和加载，请稍候..."


;Portuguese (Brazilian)
[0416]
IDS_OK = "OK"
IDS_CANCEL = "Cancelar"
IDS_YES = "Sim"
IDS_NO = "Não"
IDS_MSG_INFORMATION	=	"Informações"
IDS_MSG_WARN	=	"Aviso"
IDS_MSG_ERROR	=	"Erro"
IDS_MSG_QUS_CONFIRM	=	"Confirmação"
IDS_UNCOMPRESS_AND_LOAD	=	"Descompactando e carregando, aguarde..."


;Portuguese (PT)
[0816]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Cancelar"
IDS_YES	=	"Sim"
IDS_NO	=	"Não"
IDS_MSG_INFORMATION	=	"Informação"
IDS_MSG_WARN	=	"Atenção"
IDS_MSG_ERROR	=	"Erro"
IDS_MSG_QUS_CONFIRM	=	"Confirmação"
IDS_UNCOMPRESS_AND_LOAD	=	"A descomprimir e carregar, aguarde..."



;Russian (Standard) 
[0419]
IDS_OK = "OK"
IDS_CANCEL = "Отмена"
IDS_YES = "Да"
IDS_NO = "Нет"
IDS_MSG_INFORMATION						= "Информация"
IDS_MSG_WARN							= "Предупреждение"
IDS_MSG_ERROR							= "Ошибка"
IDS_MSG_QUS_CONFIRM						= "Подтверждение"
IDS_UNCOMPRESS_AND_LOAD	=	"Выполняется распаковка и загрузка, подождите..."


;Czech (Standard)
[0405]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Storno"
IDS_YES	=	"Ano"
IDS_NO	=	"Ne"
IDS_MSG_INFORMATION	=	"Informace"
IDS_MSG_WARN	=	"Výstraha"
IDS_MSG_ERROR	=	"Chyba"
IDS_MSG_QUS_CONFIRM	=	"Potvrzení"
IDS_UNCOMPRESS_AND_LOAD	=	"Pobíhá dekomprimace a načítání, čekejte prosím..."


;Dutch (Standard)
[0413]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Annuleren"
IDS_YES	=	"Ja"
IDS_NO	=	"Nee"
IDS_MSG_INFORMATION	=	"Informatie"
IDS_MSG_WARN	=	"Waarschuwing"
IDS_MSG_ERROR	=	"Fout"
IDS_MSG_QUS_CONFIRM	=	"Bevestiging"
IDS_UNCOMPRESS_AND_LOAD	=	"Bezig met uitpakken en laden, een ogenblik geduld…"


;India (Standard)
[044d]
IDS_OK	=	"ठीक है"
IDS_CANCEL	=	"रद्द करें"
IDS_YES	=	"हाँ"
IDS_NO	=	"नहीं"
IDS_MSG_INFORMATION	=	"जानकारी"
IDS_MSG_WARN	=	"चेतावनी"
IDS_MSG_ERROR	=	"त्रुटि"
IDS_MSG_QUS_CONFIRM	=	"पुष्टि"
IDS_UNCOMPRESS_AND_LOAD	=	"असंपीड़ित और लोड हो रहा है, कृपया प्रतीक्षा करें..."

;Hungarian (Standard)
[040E]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Mégse"
IDS_YES	=	"Igen"
IDS_NO	=	"Nem"
IDS_MSG_INFORMATION	=	"Információ"
IDS_MSG_WARN	=	"Figyelmeztetés"
IDS_MSG_ERROR	=	"Hiba"
IDS_MSG_QUS_CONFIRM	=	"Megerősítés"
IDS_UNCOMPRESS_AND_LOAD	=	"Kicsomagolás és betöltés, kis türelmet..."

;Indonesian (Standard)
[0421]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Batal"
IDS_YES	=	"Ya"
IDS_NO	=	"Tidak"
IDS_MSG_INFORMATION	=	"Informasi"
IDS_MSG_WARN	=	"Peringatan"
IDS_MSG_ERROR	=	"Kesalahan"
IDS_MSG_QUS_CONFIRM	=	"Konfirmasi"
IDS_UNCOMPRESS_AND_LOAD	=	"Dengan mengembalikan file yang dikompres ke bentuk semula dan memuat, harap tunggu..."

;Polish (Standard)
[0415]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Anuluj"
IDS_YES	=	"Tak"
IDS_NO	=	"Nie"
IDS_MSG_INFORMATION	=	"Informacje"
IDS_MSG_WARN	=	"Ostrzeżenie"
IDS_MSG_ERROR	=	"Błąd"
IDS_MSG_QUS_CONFIRM	=	"Potwierdzenie"
IDS_UNCOMPRESS_AND_LOAD	=	"Trwa rozpakowywanie i ładowanie, czekaj..."

;Slovak (Standard)
[041B]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Zrušiť"
IDS_YES	=	"Áno"
IDS_NO	=	"Nie"
IDS_MSG_INFORMATION	=	"Informácie"
IDS_MSG_WARN	=	"Upozornenie"
IDS_MSG_ERROR	=	"Chyba"
IDS_MSG_QUS_CONFIRM	=	"Potvrdenie"
IDS_UNCOMPRESS_AND_LOAD	=	"Rozbaľuje sa načítava, čakajte..."

;Thai (Standard)
[041e]
IDS_OK	=	"ตกลง"
IDS_CANCEL	=	"ยกเลิก"
IDS_YES	=	"ใช่"
IDS_NO	=	"ไม่ใช่"
IDS_MSG_INFORMATION	=	"ข้อมูล"
IDS_MSG_WARN	=	"คำเตือน"
IDS_MSG_ERROR	=	"ข้อผิดพลาด"
IDS_MSG_QUS_CONFIRM	=	"ยืนยัน"
IDS_UNCOMPRESS_AND_LOAD	=	"กำลังทำการขยายและโหลดไฟล์ โปรดรอสักครู่..."


;Turkish (Standard)
[041F]
IDS_OK	=	"Tamam"
IDS_CANCEL	=	"İptal"
IDS_YES	=	"Evet"
IDS_NO	=	"Hayır"
IDS_MSG_INFORMATION	=	"Bilgiler"
IDS_MSG_WARN	=	"Uyarı"
IDS_MSG_ERROR	=	"Hata"
IDS_MSG_QUS_CONFIRM	=	"Onay"
IDS_UNCOMPRESS_AND_LOAD	=	"Açılıyor ve yükleniyor, lütfen bekleyin..."

;Ukrainian (Standard)
[0422]
IDS_OK	=	"OК"
IDS_CANCEL	=	"Скасувати"
IDS_YES	=	"Так"
IDS_NO	=	"Ні"
IDS_MSG_INFORMATION	=	"Інформація"
IDS_MSG_WARN	=	"Попередження"
IDS_MSG_ERROR	=	"Помилка"
IDS_MSG_QUS_CONFIRM	=	"Підтвердження"
IDS_UNCOMPRESS_AND_LOAD	=	"Розпакування та завантаження, зачекайте..."


;Vietnamese (Standard)
[042a]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Hủy"
IDS_YES	=	"Có"
IDS_NO	=	"Không"
IDS_MSG_INFORMATION	=	"Thông tin"
IDS_MSG_WARN	=	"Cảnh báo"
IDS_MSG_ERROR	=	"Lỗi"
IDS_MSG_QUS_CONFIRM	=	"Xác nhận"
IDS_UNCOMPRESS_AND_LOAD	=	"Đang giải nén và tải, vui lòng đợi..."


;United Kingdom (Standard)
[0809]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Cancel"
IDS_YES	=	"Yes"
IDS_NO	=	"No"
IDS_MSG_INFORMATION	=	"Information"
IDS_MSG_WARN	=	"Warning"
IDS_MSG_ERROR	=	"Error"
IDS_MSG_QUS_CONFIRM	=	"Confirmation"
IDS_UNCOMPRESS_AND_LOAD	=	"Uncompressing and loading, please wait..."


;Arabic (Standard)
[1401]
IDS_OK	=	"موافق"
IDS_CANCEL	=	"إلغاء"
IDS_YES	=	"نعم"
IDS_NO	=	"لا"
IDS_MSG_INFORMATION	=	"معلومات"
IDS_MSG_WARN	=	"تحذير"
IDS_MSG_ERROR	=	"خطأ"
IDS_MSG_QUS_CONFIRM	=	"تأكيد"
IDS_UNCOMPRESS_AND_LOAD	=	"جاري الفك والتنزيل، يرجى الانتظار..."


;Romanian (ro)
[0418]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Revocare"
IDS_YES	=	"Da"
IDS_NO	=	"Nu"
IDS_MSG_INFORMATION	=	"Informaţii"
IDS_MSG_WARN	=	"Avertisment"
IDS_MSG_ERROR	=	"Eroare"
IDS_MSG_QUS_CONFIRM	=	"Confirmare"
IDS_UNCOMPRESS_AND_LOAD	=	"Se decomprimă şi se încarcă, aşteptaţi..."



;Croatian (hr); 
[041A]	

IDS_OK	=	"U redu"
IDS_CANCEL	=	"Odustani"
IDS_YES	=	"Da"
IDS_NO	=	"Ne"
IDS_MSG_INFORMATION	=	"Informacije"
IDS_MSG_WARN	=	"Upozorenje"
IDS_MSG_ERROR	=	"Pogreška"
IDS_MSG_QUS_CONFIRM	=	"Potvrda"

IDS_UNCOMPRESS_AND_LOAD	=	"Dekomprimiranje i učitavanje, pričekajte..."


;Norwegian(No)
[0414]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Avbryt"
IDS_YES	=	"Ja"
IDS_NO	=	"Nei"
IDS_MSG_INFORMATION	=	"Informasjon"
IDS_MSG_WARN	=	"Advarsel"
IDS_MSG_ERROR	=	"Feil"
IDS_MSG_QUS_CONFIRM	=	"Bekreftelse"
IDS_UNCOMPRESS_AND_LOAD	=	"Pakker ut og laster. Vent litt..."



;Danish            
[0406]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Annuller"
IDS_YES	=	"Ja"
IDS_NO	=	"Nej"
IDS_MSG_INFORMATION	=	"Oplysninger"
IDS_MSG_WARN	=	"Advarsel"
IDS_MSG_ERROR	=	"Fejl"
IDS_MSG_QUS_CONFIRM	=	"Bekræftelse"
IDS_UNCOMPRESS_AND_LOAD	=	"Udpakker og indlæser. Vent…"



;Finnish       
[040B]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Peruuta"
IDS_YES	=	"Kyllä"
IDS_NO	=	"Ei"
IDS_MSG_INFORMATION	=	"Tiedot"
IDS_MSG_WARN	=	"Varoitus"
IDS_MSG_ERROR	=	"Virhe"
IDS_MSG_QUS_CONFIRM	=	"Vahvistus"
IDS_UNCOMPRESS_AND_LOAD	=	"Puretaan ja ladataan, odota hetki..."

 

;Maylay
[043e]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Batal"
IDS_YES	=	"Ya"
IDS_NO	=	"Tidak"
IDS_MSG_INFORMATION	=	"Maklumat"
IDS_MSG_WARN	=	"Amaran"
IDS_MSG_ERROR	=	"Ralat"
IDS_MSG_QUS_CONFIRM	=	"Pengesahan"
IDS_UNCOMPRESS_AND_LOAD	=	"Menyahmampatkan dan memuatkan, sila tunggu..."


;Chinese (HK)     
[0C04]            
IDS_OK	=	"確定"
IDS_CANCEL	=	"取消"
IDS_YES	=	"是"
IDS_NO	=	"否"
IDS_MSG_INFORMATION	=	"資訊"
IDS_MSG_WARN	=	"警告"
IDS_MSG_ERROR	=	"錯誤"
IDS_MSG_QUS_CONFIRM	=	"確認" 
IDS_UNCOMPRESS_AND_LOAD	=	"正在解壓縮和載入，請稍候..."




;English (Australia)
[0C09]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Cancel"
IDS_YES	=	"Yes"
IDS_NO	=	"No"
IDS_MSG_INFORMATION	=	"Information"
IDS_MSG_WARN	=	"Warning"
IDS_MSG_ERROR	=	"Error"
IDS_MSG_QUS_CONFIRM	=	"Confirmation"
IDS_UNCOMPRESS_AND_LOAD	=	"Uncompressing and loading, please wait..."


;English (Canada)
[1009]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Cancel"
IDS_YES	=	"Yes"
IDS_NO	=	"No"
IDS_MSG_INFORMATION	=	"Information"
IDS_MSG_WARN	=	"Warning"
IDS_MSG_ERROR	=	"Error"
IDS_MSG_QUS_CONFIRM	=	"Confirmation"
IDS_UNCOMPRESS_AND_LOAD	=	"Uncompressing and loading, please wait..."


;French  (Canada)
[0C0C]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Annuler"
IDS_YES	=	"Oui"
IDS_NO	=	"Non"
IDS_MSG_INFORMATION	=	"Informations"
IDS_MSG_WARN	=	"Avertissement"
IDS_MSG_ERROR	=	"Erreur"
IDS_MSG_QUS_CONFIRM	=	"Confirmation"
IDS_UNCOMPRESS_AND_LOAD	=	"Décompression et chargement, veuillez patienter..."

;Greek
[0408]
IDS_OK	=	"OK"
IDS_CANCEL	=	"Άκυρο"
IDS_YES	=	"Ναι"
IDS_NO	=	"Όχι"
IDS_MSG_INFORMATION	=	"Πληροφορίες"
IDS_MSG_WARN	=	"Προειδοποίηση"
IDS_MSG_ERROR	=	"Σφάλμα"
IDS_MSG_QUS_CONFIRM	=	"Επιβεβαίωση"
 
 IDS_UNCOMPRESS_AND_LOAD	=	"Αποσυμπίεση και φόρτωση, παρακαλώ περιμένετε..."

 
   
;Hebrew  (he)
[040D]
IDS_OK	=	"אישור"
IDS_CANCEL	=	"ביטול"
IDS_YES	=	"כן"
IDS_NO	=	"לא"
IDS_MSG_INFORMATION	=	"מידע"
IDS_MSG_WARN	=	"אזהרה"
IDS_MSG_ERROR	=	"שגיאה"
IDS_MSG_QUS_CONFIRM	=	"אישור"

IDS_UNCOMPRESS_AND_LOAD	=	"מבטל כיווץ וטוען, נא להמתין..."


;Persian (fa) 
[0429]   
IDS_OK	=	"تأیید"
IDS_CANCEL	=	"لغو"
IDS_YES	=	"بله"
IDS_NO	=	"خیر"
IDS_MSG_INFORMATION	=	"اطلاعات"
IDS_MSG_WARN	=	"هشدار"
IDS_MSG_ERROR	=	"خطا"
IDS_MSG_QUS_CONFIRM	=	"تأیید"
IDS_UNCOMPRESS_AND_LOAD	=	"درحال لغو فشرده سازی و بارگذاری، لطفاً صبر کنید..."



;Korean (ko)
[0412]

IDS_OK	=	"확인"
IDS_CANCEL	=	"취소"
IDS_YES	=	"예"
IDS_NO	=	"아니요"
IDS_MSG_INFORMATION	=	"정보"
IDS_MSG_WARN	=	"경고"
IDS_MSG_ERROR	=	"오류"
IDS_MSG_QUS_CONFIRM	=	"확인"
IDS_UNCOMPRESS_AND_LOAD	=	"압축 해제 및 로드 중입니다. 기다려 주세요..."



;Macedonian 
[042F]
IDS_OK	=	"ВО РЕД"
IDS_CANCEL	=	"Откажи "
IDS_YES	=	"Да"
IDS_NO	=	"Не"
IDS_MSG_INFORMATION	=	"Информации"
IDS_MSG_WARN	=	"Предупредување"
IDS_MSG_ERROR	=	"Грешка"
IDS_MSG_QUS_CONFIRM	=	"Потврдување"
IDS_UNCOMPRESS_AND_LOAD	=	"Декомпресирање и вчитување, ве молиме почекајте..."


;Serbian (sr)
[7C1A]
IDS_OK	=	"U redu"
IDS_CANCEL	=	"Otkaži"
IDS_YES	=	"Da"
IDS_NO	=	"Ne"
IDS_MSG_INFORMATION	=	"Informacije"
IDS_MSG_WARN	=	"Upozorenje"
IDS_MSG_ERROR	=	"Greška"
IDS_MSG_QUS_CONFIRM	=	"Potvrda"
IDS_UNCOMPRESS_AND_LOAD	=	"Dekomprimovanje i uèitavanje, saèekajte..."


;Swedish (sv)
[081D]

IDS_OK	=	"OK"
IDS_CANCEL	=	"Avbryt"
IDS_YES	=	"Ja"
IDS_NO	=	"Nej"
IDS_MSG_INFORMATION	=	"Information"
IDS_MSG_WARN	=	"Varning"
IDS_MSG_ERROR	=	"Fel"
IDS_MSG_QUS_CONFIRM	=	"Bekräftelse"
IDS_UNCOMPRESS_AND_LOAD	=	"Packa upp och läs in, vänta..."



;Japanese (ja)
[0411]
IDS_OK	=	"OK"
IDS_CANCEL	=	"キャンセル"
IDS_YES	=	"はい"
IDS_NO	=	"なし"
IDS_MSG_INFORMATION	=	"最新情報"
IDS_MSG_WARN	=	"警告"
IDS_MSG_ERROR	=	"エラー"
IDS_MSG_QUS_CONFIRM	=	"確定"
IDS_UNCOMPRESS_AND_LOAD	=	"圧縮解凍して読み込んでいます。しばらくお待ちください..."

